tap "caffix/amass"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazygit"
brew "act"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "aom"
brew "pycparser"
brew "awscli"
brew "libssh2"
brew "bat"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "kubernetes-cli"
brew "dnstwist"
brew "feroxbuster"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "gitleaks"
brew "glow"
brew "go"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "hey"
brew "istioctl"
brew "openssl@1.1"
brew "john-jumbo"
brew "jq"
brew "jsonnet", link: false
brew "jsonnet-bundler"
brew "libpcap"
brew "llvm"
brew "lychee"
brew "make"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nmap"
brew "node"
brew "virtualenv"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "ripgrep"
brew "rustup-init"
brew "scorecard"
brew "shellcheck"
brew "snyk-cli"
brew "sops"
brew "sqlmap"
brew "starship"
brew "stow"
brew "tanka"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "theharvester"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
brew "zoxide"
brew "caffix/amass/amass"
brew "fluxcd/tap/flux"
brew "jesseduffield/lazygit/lazygit"
cask "amethyst"
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"
cask "google-cloud-sdk"
cask "kitty"
cask "menumeters"
cask "postman"
cask "spotify"
