### Package Management & Taps

brew "mise"

tap "caffix/amass"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazygit"

### Development Tools & Programming Languages

brew "gcc"
brew "llvm"
brew "make"

### Version Control & Git Utilities

brew "lefthook"
brew "gh"
brew "git"
brew "pre-commit"
brew "stow"
brew "lazygit"

### Kubernetes & Cloud Tools

brew "google-cloud-sdk"

### Security & Pentesting Tools

brew "amass"
brew "dnstwist"
brew "feroxbuster"
brew "john-jumbo"
brew "nmap"
brew "sqlmap"
brew "theharvester"

### CLI Utilities & Enhancements

brew "procs"
brew "btop"
brew "eza"
brew "tldr"
brew "jq"
brew "yq"
brew "bat"
brew "fzf"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "act"
brew "tmux"
brew "glow"
brew "neofetch"
brew "ruff"
brew "sops"
brew "tree"
brew "zoxide"

### System Utilities

brew "hey"
brew "stats"

### Text Editors & IDEs

brew "neovim"
cask "ghostty"
cask "kitty"

### Image & Graphics Processing

brew "aom"
brew "gd"
brew "gdk-pixbuf"
brew "graphviz"
brew "gts"
brew "harfbuzz"
brew "libavif"
brew "librsvg"
brew "libtiff"
brew "little-cms2"
brew "netpbm"
brew "webp"
brew "zstd"

### Font & UI Customization

cask "amethyst"
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"

### Networking & Debugging

brew "mtr"
brew "httpie"
brew "masscan"
brew "libpcap"

### Miscellaneous DevOps Tools

brew "scorecard"

### Communication & Productivity

cask "postman"
cask "spotify"